# 1: Introduction

In the last mission, we began investigating possible relationships between SAT scores and demographic factors. In order to do this, we acquired several data sets about New York City public schools. We manipulated these data sets, and found that we could combine them all using the DBN column. All of the data sets are currently stored as keys in the data dictionary. Each individual data set is a pandas dataframe.

In this mission, we'll clean the data a bit more, then combine it. Finally, we'll compute correlations and perform some analysis.

The first thing we'll need to do in preparation for the merge is condense some of the data sets. In the last mission, we noticed that the values in the DBN column were unique in the sat_results data set. Other data sets like class_size had duplicate DBN values, however.

We'll need to condense these data sets so that each value in the DBN column is unique. If not, we'll run into issues when it comes time to combine the data sets.

While the main data set we want to analyze, sat_results, has unique DBN values for every high school in New York City, other data sets aren't as clean. A single row in the sat_results data set may match multiple columns in the class_size data set, for example. This situation will create problems, because we don't know which of the multiple entries in the class_size data set we should combine with the single matching entry in sat_results. Here's a diagram that illustrates the problem:

<img src='cartesian_product.png'>

In the diagram above, we can't just combine the rows from both data sets because there are several cases where multiple rows in class_size match a single row in sat_results.

To resolve this issue, we'll condense the class_size, graduation, and demographics data sets so that each DBN is unique.

# 2: Condensing the Class Size Data Set

The first data set that we'll condense is class_size. The first few rows of class_size look like this:
	
       CSD 	BOROUGH 	SCHOOL CODE 	SCHOOL NAME 	GRADE 	PROGRAM TYPE 	CORE SUBJECT (MS CORE and 9-12 ONLY) 	CORE COURSE (MS CORE and 9-12 ONLY) 	SERVICE CATEGORY(K-9* ONLY) 	NUMBER OF STUDENTS / SEATS FILLED 	NUMBER OF SECTIONS 	AVERAGE CLASS SIZE 	SIZE OF SMALLEST CLASS 	SIZE OF LARGEST CLASS 	DATA SOURCE 	SCHOOLWIDE PUPIL-TEACHER RATIO 	padded_csd 	DBN
    0 	1 	M 	M015 	P.S. 015 Roberto Clemente 	0K 	GEN ED 	- 	- 	- 	19.0 	1.0 	19.0 	19.0 	19.0 	ATS 	NaN 	01 	01M015
    1 	1 	M 	M015 	P.S. 015 Roberto Clemente 	0K 	CTT 	- 	- 	- 	21.0 	1.0 	21.0 	21.0 	21.0 	ATS 	NaN 	01 	01M015
    2 	1 	M 	M015 	P.S. 015 Roberto Clemente 	01 	GEN ED 	- 	- 	- 	17.0 	1.0 	17.0 	17.0 	17.0 	ATS 	NaN 	01 	01M015
    3 	1 	M 	M015 	P.S. 015 Roberto Clemente 	01 	CTT 	- 	- 	- 	17.0 	1.0 	17.0 	17.0 	17.0 	ATS 	NaN 	01 	01M015
    4 	1 	M 	M015 	P.S. 015 Roberto Clemente 	02 	GEN ED 	- 	- 	- 	15.0 	1.0 	15.0 	15.0 	15.0 	ATS 	NaN 	01 	01M015

As you can see, the first few rows all pertain to the same school, which is why the DBN appears more than once. It looks like each school has multiple values for GRADE, PROGRAM TYPE, CORE SUBJECT (MS CORE and 9-12 ONLY), and CORE COURSE (MS CORE and 9-12 ONLY).

If we look at the unique values for GRADE, we get the following:

    array(['0K', '01', '02', '03', '04', '05', '0K-09', nan, '06', '07', '08',

       'MS Core', '09-12', '09'], dtype=object)

Because we're dealing with high schools, we're only concerned with grades 9 through 12. That means we only want to pick rows where the value in the GRADE column is 09-12.

If we look at the unique values for PROGRAM TYPE, we get the following:

    array(['GEN ED', 'CTT', 'SPEC ED', nan, 'G&T'], dtype=object)

Each school can have multiple program types. Because GEN ED is the largest category by far, let's only select rows where PROGRAM TYPE is GEN ED

# 3: Condensing the Class Size Data Set

## Instructions

    Create a new variable called class_size, and assign the value of data["class_size"] to it.
    Filter class_size so the GRADE column only contains the value 09-12. Note that the name of the GRADE column has a space at the end; you'll generate an error if you don't include it.
    Filter class_size so that the PROGRAM TYPE column only contains the value GEN ED.
    Display the first five rows of class_size to verify.

In [1]:
import pandas as pd
data_files = [
    "ap_2010.csv",
    "class_size.csv",
    "demographics.csv",
    "graduation.csv",
    "hs_directory.csv",
    "sat_results.csv"
]
data = {}

for file in data_files:
    df = pd.read_csv( "../data/" + file )
    data[file.split( "." )[0]] = df
    
# normal string concatanation won't work here
def pad_csd(num):
    string_representation = str(num)
    if len(string_representation) > 1:
        return string_representation
    else:
        return string_representation.zfill(2)
    

data['hs_directory']['DBN'] = data['hs_directory']['dbn']

data['class_size']["padded_csd"] = data['class_size']['CSD'].apply( pad_csd )
data['class_size']["DBN"] = data['class_size']["padded_csd"] + data['class_size']["SCHOOL CODE"]

In [2]:
class_size = data['class_size']
class_size = class_size[ class_size['GRADE '] == '09-12']
class_size = class_size[ class_size['PROGRAM TYPE'] == 'GEN ED']
print( class_size.head( 5 ))

     CSD BOROUGH SCHOOL CODE                                    SCHOOL NAME  \
225    1       M        M292  Henry Street School for International Studies
226    1       M        M292  Henry Street School for International Studies
227    1       M        M292  Henry Street School for International Studies
228    1       M        M292  Henry Street School for International Studies
229    1       M        M292  Henry Street School for International Studies

    GRADE  PROGRAM TYPE CORE SUBJECT (MS CORE and 9-12 ONLY)  \
225  09-12       GEN ED                              ENGLISH
226  09-12       GEN ED                              ENGLISH
227  09-12       GEN ED                              ENGLISH
228  09-12       GEN ED                              ENGLISH
229  09-12       GEN ED                                 MATH

    CORE COURSE (MS CORE and 9-12 ONLY) SERVICE CATEGORY(K-9* ONLY)  \
225                           English 9                           -
226                          English 10                           -
227                          English 11                           -
228                          English 12                           -
229                  Integrated Algebra                           -

     NUMBER OF STUDENTS / SEATS FILLED  NUMBER OF SECTIONS  \
225                               63.0                 3.0
226                               79.0                 3.0
227                               38.0                 2.0
228                               69.0                 3.0
229                               53.0                 3.0

     AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  SIZE OF LARGEST CLASS  \
225                21.0                    19.0                   25.0
226                26.3                    24.0                   31.0
227                19.0                    16.0                   22.0
228                23.0                    13.0                   30.0
229                17.7                    16.0                   21.0

    DATA SOURCE  SCHOOLWIDE PUPIL-TEACHER RATIO padded_csd     DBN
225       STARS                             NaN         01  01M292
226       STARS                             NaN         01  01M292
227       STARS                             NaN         01  01M292
228       STARS                             NaN         01  01M292
229       STARS                             NaN         01  01M292

# 4: Computing Average Class Sizes

As we saw when we displayed class_size on the last screen, DBN still isn't completely unique. This is due to the CORE COURSE (MS CORE and 9-12 ONLY) and CORE SUBJECT (MS CORE and 9-12 ONLY) columns.

CORE COURSE (MS CORE and 9-12 ONLY) and CORE SUBJECT (MS CORE and 9-12 ONLY) seem to pertain to different kinds of classes. For example, here are the unique values for CORE SUBJECT (MS CORE and 9-12 ONLY):

    array(['ENGLISH', 'MATH', 'SCIENCE', 'SOCIAL STUDIES'], dtype=object)

This column only seems to include certain subjects. We want our class size data to include every single class a school offers -- not just a subset of them. What we can do is take the average across all of the classes a school offers. This will give us unique DBN values, while also incorporating as much data as possible into the average.

Fortunately, we can use the pandas.DataFrame.groupby() method to help us with this. The DataFrame.groupby() method will split a dataframe up into unique groups, based on a given column. We can then use the agg() method on the resulting pandas.core.groupby object to find the mean of each column.

Let's say we have this data set:

<img src='classize_table.png'>

Using the groupby() method, we'll split this dataframe into four separate groups -- one with the DBN 01M292, one with the DBN 01M332, one with the DBN 01M378, and one with the DBN 01M448:

<img src='classsize_agg.png'>

Then, we can compute the averages for the AVERAGE CLASS SIZE column in each of the four groups using the agg() method:

<img src='classsize_result.png'>

After we group a dataframe and aggregate data based on it, the column we performed the grouping on (in this case DBN) will become the index, and will no longer appear as a column in the data itself. To undo this change and keep DBN as a column, we'll need to use pandas.DataFrame.reset_index(). This method will reset the index to a list of integers and make DBN a column again.

# 5: Computing Average Class Sizes

## Instructions

    Find the average values for each column associated with each DBN in class_size.
        Use the pandas.DataFrame.groupby() method to group class_size by DBN.
        Use the agg() method on the resulting pandas.core.groupby object, along with the numpy.mean() function as an argument, to calculate the average of each group.
        Assign the result back to class_size.
    Reset the index to make DBN a column again.
        Use the pandas.DataFrame.reset_index() method, along with the keyword argument inplace=True.
    Assign class_size back to the class_size key of the data dictionary.
    Display the first few rows of data["class_size"] to verify that everything went ok

In [3]:
import numpy

# this kind of approach does aggregation on each and every column
class_size = class_size.groupby("DBN").agg(numpy.mean)

# After we group a dataframe and aggregate data based on it, 
# the column we performed the grouping on (in this case DBN) will become the index,
# and will no longer appear as a column in the data itself. To undo this change and keep DBN as a column, 
# we'll need to use pandas.DataFrame.reset_index(). This method will reset the index to a list of integers and make DBN a column again.
class_size.reset_index(inplace=True)
data["class_size"] = class_size
print( data["class_size"].head( 5 ) )

      DBN  CSD  NUMBER OF STUDENTS / SEATS FILLED  NUMBER OF SECTIONS  \
0  01M292    1                            88.0000            4.000000
1  01M332    1                            46.0000            2.000000
2  01M378    1                            33.0000            1.000000
3  01M448    1                           105.6875            4.750000
4  01M450    1                            57.6000            2.733333

   AVERAGE CLASS SIZE  SIZE OF SMALLEST CLASS  SIZE OF LARGEST CLASS  \
0           22.564286                   18.50              26.571429
1           22.000000                   21.00              23.500000
2           33.000000                   33.00              33.000000
3           22.231250                   18.25              27.062500
4           21.200000                   19.40              22.866667

   SCHOOLWIDE PUPIL-TEACHER RATIO
0                             NaN
1                             NaN
2                             NaN
3                             NaN
4                             NaN

# 6: Condensing the Demographics Data Set

Now that we've finished condensing class_size, let's condense demographics. The first few rows look like the cell above.

In this case, the only column that prevents a given DBN from being unique is schoolyear. We only want to select rows where schoolyear is 20112012. This will give us the most recent year of data, and also match our SAT results data.

# 7: Condensing the Demographics Data Set

## Instructions

    Filter demographics, only selecting rows in data["demographics"] where schoolyear is 20112012.
        schoolyear is actually an integer, so be careful about how you perform your comparison.
    Display the first few rows of data["demographics"] to verify that the filtering worked.

In [4]:
demographics = data['demographics']

demographics = demographics[ demographics['schoolyear'] == 20112012 ]
data['demographics'] = demographics
print ( data['demographics'].head( 5 ) )

       DBN                                              Name  schoolyear  \
6   01M015  P.S. 015 ROBERTO CLEMENTE                           20112012
13  01M019  P.S. 019 ASHER LEVY                                 20112012
20  01M020  PS 020 ANNA SILVER                                  20112012
27  01M034  PS 034 FRANKLIN D ROOSEVELT                         20112012
35  01M063  PS 063 WILLIAM MCKINLEY                             20112012

   fl_percent  frl_percent  total_enrollment prek    k grade1 grade2  \
6         NaN         89.4               189   13   31     35     28
13        NaN         61.5               328   32   46     52     54
20        NaN         92.5               626   52  102    121     87
27        NaN         99.7               401   14   34     38     36
35        NaN         78.9               176   18   20     30     21

      ...     black_num black_per hispanic_num hispanic_per white_num  \
6     ...            63      33.3          109         57.7         4
13    ...            81      24.7          158         48.2        28
20    ...            55       8.8          357         57.0        16
27    ...            90      22.4          275         68.6         8
35    ...            41      23.3          110         62.5        15

   white_per male_num male_per female_num female_per
6        2.1     97.0     51.3       92.0       48.7
13       8.5    147.0     44.8      181.0       55.2
20       2.6    330.0     52.7      296.0       47.3
27       2.0    204.0     50.9      197.0       49.1
35       8.5     97.0     55.1       79.0       44.9

[5 rows x 38 columns]

# 8: Condensing the Graduation Data Set

Finally, we'll need to condense the graduation data set. Here are the first few rows:
	
    Demographic 	DBN 	School Name 	Cohort 	Total Cohort 	Total Grads - n 	Total Grads - % of cohort 	Total Regents - n 	Total Regents - % of cohort 	Total Regents - % of grads 	... 	Regents w/o Advanced - n 	Regents w/o Advanced - % of cohort 	Regents w/o Advanced - % of grads 	Local - n 	Local - % of cohort 	Local - % of grads 	Still Enrolled - n 	Still Enrolled - % of cohort 	Dropped Out - n 	Dropped Out - % of cohort
    0 	Total Cohort 	01M292 	HENRY STREET SCHOOL FOR INTERNATIONAL 	2003 	5 	s 	s 	s 	s 	s 	... 	s 	s 	s 	s 	s 	s 	s 	s 	s 	s
    1 	Total Cohort 	01M292 	HENRY STREET SCHOOL FOR INTERNATIONAL 	2004 	55 	37 	67.3% 	17 	30.9% 	45.9% 	... 	17 	30.9% 	45.9% 	20 	36.4% 	54.1% 	15 	27.3% 	3 	5.5%
    2 	Total Cohort 	01M292 	HENRY STREET SCHOOL FOR INTERNATIONAL 	2005 	64 	43 	67.2% 	27 	42.2% 	62.8% 	... 	27 	42.2% 	62.8% 	16 	25% 	37.200000000000003% 	9 	14.1% 	9 	14.1%
    3 	Total Cohort 	01M292 	HENRY STREET SCHOOL FOR INTERNATIONAL 	2006 	78 	43 	55.1% 	36 	46.2% 	83.7% 	... 	36 	46.2% 	83.7% 	7 	9% 	16.3% 	16 	20.5% 	11 	14.1%
    4 	Total Cohort 	01M292 	HENRY STREET SCHOOL FOR INTERNATIONAL 	2006 Aug 	78 	44 	56.4% 	37 	47.4% 	84.1% 	... 	37 	47.4% 	84.1% 	7 	9% 	15.9% 	15 	19.2% 	11 	14.1%

The Demographic and Cohort columns are what prevent DBN from being unique in the graduation data. A Cohort appears to refer to the year the data represents, and the Demographic appears to refer to a specific demographic group. In this case, we want to pick data from the most recent Cohort available, which is 2006. We also want data from the full cohort, so we'll only pick rows where Demographic is Total Cohort.

# 9: Condensing the Graduation Data Set

## Instructions

    Filter graduation, only selecting rows where the Cohort column equals 2006.
    Filter graduation, only selecting rows where the Demographic column equals Total Cohort.
    Display the first few rows of data["graduation"] to verify that everything worked properly.

In [5]:
graduation = data['graduation']

graduation = graduation[ graduation['Cohort'] == "2006" ]
graduation = graduation[ graduation['Demographic'] == 'Total Cohort' ]

data['graduation'] = graduation
print ( data['graduation'].head( 5 ) )

     Demographic     DBN                            School Name Cohort  \
3   Total Cohort  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL   2006
10  Total Cohort  01M448    UNIVERSITY NEIGHBORHOOD HIGH SCHOOL   2006
17  Total Cohort  01M450             EAST SIDE COMMUNITY SCHOOL   2006
24  Total Cohort  01M509                MARTA VALLE HIGH SCHOOL   2006
31  Total Cohort  01M515  LOWER EAST SIDE PREPARATORY HIGH SCHO   2006

    Total Cohort Total Grads - n Total Grads - % of cohort Total Regents - n  \
3             78              43                     55.1%                36
10           124              53                     42.7%                42
17            90              70                     77.8%                67
24            84              47                       56%                40
31           193             105                     54.4%                91

   Total Regents - % of cohort Total Regents - % of grads  \
3                        46.2%                      83.7%
10                       33.9%                      79.2%
17         74.400000000000006%                      95.7%
24                       47.6%                      85.1%
31                       47.2%                      86.7%

              ...            Regents w/o Advanced - n  \
3             ...                                  36
10            ...                                  34
17            ...                                  67
24            ...                                  23
31            ...                                  22

   Regents w/o Advanced - % of cohort Regents w/o Advanced - % of grads  \
3                               46.2%                             83.7%
10                              27.4%                             64.2%
17                74.400000000000006%                             95.7%
24                              27.4%                             48.9%
31                              11.4%                               21%

   Local - n Local - % of cohort Local - % of grads Still Enrolled - n  \
3          7                  9%              16.3%                 16
10        11                8.9%              20.8%                 46
17         3                3.3%               4.3%                 15
24         7  8.300000000000001%              14.9%                 25
31        14                7.3%              13.3%                 53

   Still Enrolled - % of cohort Dropped Out - n Dropped Out - % of cohort
3                         20.5%              11                     14.1%
10                        37.1%              20       16.100000000000001%
17                        16.7%               5                      5.6%
24                        29.8%               5                        6%
31                        27.5%              35       18.100000000000001%

[5 rows x 23 columns]

# 10: Converting AP Test Scores

We're almost ready to combine all of the data sets. The only remaining thing to do is convert the Advanced Placement (AP) test scores from strings to numeric values. High school students take the AP exams before applying to college. There are several AP exams, each corresponding to a school subject. High school students who earn high scores may receive college credit.

AP exams have a 1 to 5 scale; 3 or higher is a passing score. Many high school students take AP exams -- particularly those who attend academically challenging institutions. AP exams are much more rare in schools that lack funding or academic rigor.

It will be interesting to find out whether AP exam scores are correlated with SAT scores across high schools. To determine this, we'll need to convert the AP exam scores in the ap_2010 data set to numeric values first.

There are three columns we'll need to convert:

    AP Test Takers (note that there's a trailing space in the column name)
    Total Exams Taken
    Number of Exams with scores 3 4 or 5

Note that the first column name above, AP Test Takers, has a trailing space at the end.

## Instructions

    Convert each of the following columns in ap_2010 to numeric values using the pandas.to_numeric() function with the keyword argument errors="coerce".
        AP Test Takers
        Total Exams Taken
        Number of Exams with scores 3 4 or 5
    Display the first few rows of ap_2010 to confirm.

In [6]:
cols = ['AP Test Takers ', 'Total Exams Taken', 'Number of Exams with scores 3 4 or 5']
for col in cols:
    data["ap_2010"][col] = pd.to_numeric(data["ap_2010"][col], errors="coerce")
    
print(data["ap_2010"].head())

      DBN                             SchoolName  AP Test Takers   \
0  01M448           UNIVERSITY NEIGHBORHOOD H.S.             39.0
1  01M450                 EAST SIDE COMMUNITY HS             19.0
2  01M515                    LOWER EASTSIDE PREP             24.0
3  01M539         NEW EXPLORATIONS SCI,TECH,MATH            255.0
4  02M296  High School of Hospitality Management              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5
0               49.0                                  10.0
1               21.0                                   NaN
2               26.0                                  24.0
3              377.0                                 191.0
4                NaN                                   NaN

# 1: Left, Right, Inner, and Outer Joins

Before we merge our data, we'll need to decide on the merge strategy we want to use. We'll be using the pandas pandas.DataFrame.merge() function, which supports four types of joins -- left, right, inner, and outer. Each of these join types dictates how pandas combines the rows.

We'll be using the DBN column to identify matching rows across data sets. In other words, the values in that column will help us know which row from the first data set to combine with which row in the second data set.

There may be DBN values that exist in one data set but not in another. This is partly because the data is from different years. Each data set also has inconsistencies in terms of how it was gathered. Human error (and other types of errors) may also play a role. Therefore, we may not find matches for the DBN values in sat_results in all of the other data sets, and other data sets may have DBN values that don't exist in sat_results.

We'll merge two data sets at a time. For example, we'll merge sat_results and hs_directory, then merge the result with ap_2010, then merge the result of that with class_size. We'll continue combining data sets in this way until we've merged all of them. Afterwards, we'll have roughly the same number of rows, but each row will have columns from all of the data sets.

The merge strategy we pick will affect the number of rows we end up with. Let's take a look at each strategy.

Let's say we're merging the following two data sets:

- With an inner merge, we'd only combine rows where the same DBN exists in both data sets. We'd end up with this result:

- With a left merge, we'd only use DBN values from the dataframe on the "left" of the merge. In this case, sat_results is on the left. Some of the DBNs in sat_results don't exist in class_size, though. The merge will handle this by assiging null values to the columns in sat_results that don't have corresponding data in class_size.

- With a right merge, we'll only use DBN values from the dataframe on the "right" of the merge. In this case, class_size is on the right

- With an outer merge, we'll take any DBN values from either sat_results or class_size:

As you can see, each merge strategy has its advantages. Depending on the strategy we choose, we may preserve rows at the expense of having more missing column data, or minimize missing data at the expense of having fewer rows. Choosing a merge strategy is an important decision; it's worth thinking about your data carefully, and what trade-offs you're willing to make.

Because this project is concerned with determing demographic factors that correlate with SAT score, we'll want to preserve as many rows as possible from sat_results while minimizing null values.

This means that we may need to use different merge strategies with different data sets. Some of the data sets have a lot of missing DBN values. This makes a left join more appropriate, because we don't want to lose too many rows when we merge. If we did an inner join, we would lose the data for many high schools.

Some data sets have DBN values that are almost identical to those in sat_results. Those data sets also have information we need to keep. Most of our analysis would be impossible if a significant number of rows was missing from demographics, for example. Therefore, we'll do an inner join to avoid missing data in these columns.

# 12: Performing the Left Joins

Both the ap_2010 and the graduation data sets have many missing DBN values, so we'll use a left join when we merge the sat_results data set with them. Because we're using a left join, our final dataframe will have all of the same DBN values as the original sat_results dataframe.

We'll need to use the pandas df.merge() method to merge dataframes. The "left" dataframe is the one we call the method on, and the "right" dataframe is the one we pass into df.merge().

Because we're using the DBN column to join the dataframes, we'll need to specify the keyword argument on="DBN" when calling pandas.DataFrame..merge().

First, we'll assign data["sat_results"] to the variable combined. Then, we'll merge all of the other dataframes with combined. When we're finished, combined will have all of the columns from all of the data sets.

## Instructions

    Use the pandas pandas.DataFrame.merge() method to merge the ap_2010 data set into combined.
        Make sure to specify how="left" as a keyword argument to indicate the correct join type.
        Make sure to assign the result of the merge operation back to combined.
    Use the pandas df.merge() method to merge the graduation data set into combined.
        Make sure to specify how="left" as a keyword argument to get the correct join type.
        Make sure to assign the result of the merge operation back to combined.
    Display the first few rows of combined to verify that the correct operations occurred.
    Use the pandas.DataFrame.shape() method to display the shape of the dataframe and see how many rows now exist.

In [7]:
combined = data['sat_results']
combined = combined.merge( data['ap_2010'], on='DBN', how='left' )
combined = combined.merge( data['graduation'], on='DBN', how='left' )
print ( combined.head( 5 ) )
combined.shape

      DBN                                    SCHOOL NAME  \
0  01M292  HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448            UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                     EAST SIDE COMMUNITY SCHOOL
3  01M458                      FORSYTH SATELLITE ACADEMY
4  01M509                        MARTA VALLE HIGH SCHOOL

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                      7                             414                 401
4                     44                             390                 433

  SAT Writing Avg. Score                    SchoolName  AP Test Takers   \
0                    363                           NaN              NaN
1                    366  UNIVERSITY NEIGHBORHOOD H.S.             39.0
2                    370        EAST SIDE COMMUNITY HS             19.0
3                    359                           NaN              NaN
4                    384                           NaN              NaN

   Total Exams Taken  Number of Exams with scores 3 4 or 5  \
0                NaN                                   NaN
1               49.0                                  10.0
2               21.0                                   NaN
3                NaN                                   NaN
4                NaN                                   NaN

             ...            Regents w/o Advanced - n  \
0            ...                                  36
1            ...                                  34
2            ...                                  67
3            ...                                 NaN
4            ...                                  23

  Regents w/o Advanced - % of cohort Regents w/o Advanced - % of grads  \
0                              46.2%                             83.7%
1                              27.4%                             64.2%
2                74.400000000000006%                             95.7%
3                                NaN                               NaN
4                              27.4%                             48.9%

   Local - n Local - % of cohort Local - % of grads Still Enrolled - n  \
0          7                  9%              16.3%                 16
1         11                8.9%              20.8%                 46
2          3                3.3%               4.3%                 15
3        NaN                 NaN                NaN                NaN
4          7  8.300000000000001%              14.9%                 25

  Still Enrolled - % of cohort Dropped Out - n Dropped Out - % of cohort
0                        20.5%              11                     14.1%
1                        37.1%              20       16.100000000000001%
2                        16.7%               5                      5.6%
3                          NaN             NaN                       NaN
4                        29.8%               5                        6%

[5 rows x 32 columns]

(479, 32)

# 13: Performing the Inner Joins

Now that we've performed the left joins, we still have to merge class_size, demographics, survey, and hs_directory into combined. Because these files contain information that's more valuable to our analysis and also have fewer missing DBN values, we'll use the inner join type.

# Instructions

    Merge class_size into combined. Then, merge class_size, demographics, survey, and hs_directory into combined one by one, in that order.
        Be sure to follow the exact order above.
        Remember to specify the correct column to join on, as well as the correct join type.
    Display the first few rows of combined to verify that the correct operations occurred.
    Call pandas.DataFrame.shape() to display the shape of the dataframe to see how many rows now exist.

In [8]:
all_survey = pd.read_csv( "../data/survey_all.txt", delimiter="\t", encoding="windows-1252" )
d75_survey = pd.read_csv( "../data/survey_d75.txt", delimiter="\t", encoding="windows-1252" )

survey = pd.concat( [ all_survey, d75_survey ] , axis=0 )
# survey.head( 5 )

survey["DBN"] = survey["dbn"]
survey_cols = ["DBN", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"]
["dbn", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", "com_tot_11", "eng_tot_11", "aca_tot_11"]

data['survey'] = survey.loc[:,survey_cols]

In [9]:
combined = combined.merge( data['class_size'], on='DBN', how='inner' )
combined = combined.merge( data['demographics'], on='DBN', how='inner' )
combined = combined.merge( data['survey'], on='DBN', how='inner' )
combined = combined.merge( data['hs_directory'], on='DBN', how='inner' )
print( combined.head() )
combined.shape

      DBN                                        SCHOOL NAME  \
0  01M292      HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1  01M448                UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2  01M450                         EAST SIDE COMMUNITY SCHOOL
3  01M509                            MARTA VALLE HIGH SCHOOL
4  01M539  NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...

  Num of SAT Test Takers SAT Critical Reading Avg. Score SAT Math Avg. Score  \
0                     29                             355                 404
1                     91                             383                 423
2                     70                             377                 402
3                     44                             390                 433
4                    159                             522                 574

  SAT Writing Avg. Score                      SchoolName  AP Test Takers   \
0                    363                             NaN              NaN
1                    366    UNIVERSITY NEIGHBORHOOD H.S.             39.0
2                    370          EAST SIDE COMMUNITY HS             19.0
3                    384                             NaN              NaN
4                    525  NEW EXPLORATIONS SCI,TECH,MATH            255.0

   Total Exams Taken  Number of Exams with scores 3 4 or 5  \
0                NaN                                   NaN
1               49.0                                  10.0
2               21.0                                   NaN
3                NaN                                   NaN
4              377.0                                 191.0

                         ...                          \
0                        ...
1                        ...
2                        ...
3                        ...
4                        ...

                                          priority02  \
0  Then to Manhattan students or residents who at...
1  For M35B only: Open only to students whose hom...
2                    Then to New York City residents
3            Then to Manhattan students or residents
4                    Then to New York City residents

                                          priority03  \
0  Then to New York City residents who attend an ...
1                                                NaN
2                                                NaN
3                    Then to New York City residents
4                                                NaN

                                priority04                       priority05  \
0  Then to Manhattan students or residents  Then to New York City residents
1                                      NaN                              NaN
2                                      NaN                              NaN
3                                      NaN                              NaN
4                                      NaN                              NaN

  priority06 priority07 priority08 priority09 priority10  \
0        NaN        NaN        NaN        NaN        NaN
1        NaN        NaN        NaN        NaN        NaN
2        NaN        NaN        NaN        NaN        NaN
3        NaN        NaN        NaN        NaN        NaN
4        NaN        NaN        NaN        NaN        NaN

                                          Location 1
0  220 Henry Street\nNew York, NY 10002\n(40.7137...
1  200 Monroe Street\nNew York, NY 10002\n(40.712...
2  420 East 12 Street\nNew York, NY 10009\n(40.72...
3  145 Stanton Street\nNew York, NY 10002\n(40.72...
4  111 Columbia Street\nNew York, NY 10002\n(40.7...

[5 rows x 156 columns]

(363, 156)

# 14: Filling in Missing Values

You may have noticed that the inner joins resulted in 116 fewer rows in sat_results. This is because pandas couldn't find the DBN values that existed in sat_results in the other data sets. While this is worth investigating, we're currently looking for high-level correlations, so we don't need to dive into which DBNs are missing.

You may also have noticed that we now have many columns with null (NaN) values. This is because we chose to do left joins, where some columns may not have had data. The data set also had some missing values to begin with. If we hadn't performed a left join, all of the rows with missing data would have been lost in the merge process, which wouldn't have left us with many high schools in our data set.

There are several ways to handle missing data, and we'll cover them in more detail later on. For now, we'll just fill in the missing values with the overall mean for the column, like so:

In the diagram above, the mean of the first column is (1800 + 1600 + 2200 + 2300) / 4, or 1975, and the mean of the second column is (20 + 30 + 30 + 50) / 4, or 32.5. We replace the missing values with the means of their respective columns, which allows us to proceed with analyses that can't handle missing values (like correlations).

We can fill in missing data in pandas using the pandas.DataFrame.fillna() method. This method will replace any missing values in a dataframe with the values we specify. We can compute the mean of every column using the pandas.DataFrame.mean() method. If we pass the results of the df.mean() method into the df.fillna() method, pandas will fill in the missing values in each column with the mean of that column.

Here's an example of how we would accomplish this:

    means = df.mean()

    df = df.fillna(means)

Note that if a column consists entirely of null or NaN values, pandas won't be able to fill in the missing values when we use the df.fillna() method along with the df.mean() method, because there won't be a mean.

We should fill any NaN or null values that remain after the initial replacement with the value 0. We can do this by passing 0 into the df.fillna() method.

## 15: Filling in Missing Values

# Instructions

    Calculate the means of all of the columns in combined using the pandas.DataFrame.mean() method.
    Fill in any missing values in combined with the means of the respective columns using the pandas.DataFrame.fillna() method.
    Fill in any remaining missing values in combined with 0 using the df.fillna() method.
    Display the first few rows of combined to verify that the correct operations occurred.

In [10]:
mean = combined.mean()
combined = combined.fillna( mean )
combined = combined.fillna( 0 )
combined.head( 5 )

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SchoolName,AP Test Takers,Total Exams Taken,Number of Exams with scores 3 4 or 5,...,priority02,priority03,priority04,priority05,priority06,priority07,priority08,priority09,priority10,Location 1
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,0,129.028846,197.038462,153.45,...,Then to Manhattan students or residents who at...,Then to New York City residents who attend an ...,Then to Manhattan students or residents,Then to New York City residents,0,0,0,0,0,"220 Henry Street\nNew York, NY 10002\n(40.7137..."
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,UNIVERSITY NEIGHBORHOOD H.S.,39.000000,49.000000,10.00,...,For M35B only: Open only to students whose hom...,0,0,0,0,0,0,0,0,"200 Monroe Street\nNew York, NY 10002\n(40.712..."
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,EAST SIDE COMMUNITY HS,19.000000,21.000000,153.45,...,Then to New York City residents,0,0,0,0,0,0,0,0,"420 East 12 Street\nNew York, NY 10009\n(40.72..."
3,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,0,129.028846,197.038462,153.45,...,Then to Manhattan students or residents,Then to New York City residents,0,0,0,0,0,0,0,"145 Stanton Street\nNew York, NY 10002\n(40.72..."
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159,522,574,525,"NEW EXPLORATIONS SCI,TECH,MATH",255.000000,377.000000,191.00,...,Then to New York City residents,0,0,0,0,0,0,0,0,"111 Columbia Street\nNew York, NY 10002\n(40.7..."

# 16: Adding a School District Column for Mapping

We've finished cleaning and combining our data! We now have a clean data set on which we can base our analysis. Mapping the statistics out on a school district level might be an interesting way to analyze them. Adding a column to the data set that specifies the school district will help us accomplish this.

The school district is just the first two characters of the DBN. We can apply a function over the DBN column of combined that pulls out the first two letters.

For example, we can use indexing to extract the first few characters of a string, like this:

name = "Sinbad"

print(name[0:2])

# Instructions

    Write a function that extracts the first two characters of a string and returns them.
    Apply the function to the DBN column of combined, and assign the result to the school_dist column of combined.
    Display the first few items in the school_dist column of combined to verify the results.

In [14]:
def firsttwo( input ):
    return input[0:2]

combined['school_dict'] = combined['DBN'].apply( firsttwo )
print( combined.shape )

(363, 157)

# 17: Next Steps

We now have a clean data set we can analyze! We've done a lot in this mission. We've gone from having several messy sources to one clean, combined, data set that's ready for analysis.

Along the way, we've learned about:

    How to handle missing values
    Different types of merges
    How to condense data sets
    How to compute averages across dataframes

Data scientists rarely start out with tidy data sets, which makes cleaning and combining them one of the most critical skills any data professional can learn.

In the next mission, we'll analyze our clean data to find correlations and create maps.